app/views/posts/_posts.html.erb

    <div class='span8 well'>
   	  <% post.categories.each do |category| %>
---
SELECT "categories".* FROM "categories" INNER JOIN "post_categories" ON "categories"."id" = "post_categories"."category_id" WHERE "post_categories"."post_id" = ?  [["post_id", 1]]

    <p><span class='quiet'>posted by: </span><%= link_to "#{post.creator.username}", user_path(post.creator)%></p>
    <p><small><%= link_to "#{post.comments.size} comments", post_path(post)%></small></p>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]