app/views/posts/index.html.erb

SELECT "categories".* FROM "categories" INNER JOIN "post_categories" ON "categories"."id" = "post_categories"."category_id" WHERE "post_categories"."post_id" = ?  [["post_id", 1]]
---

    <p><% post.categories.each do |category| %>

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]
---

    <p><small><%= link_to("#{post.comments.size} comments")%></small></p>