app/controllers/categories_controller.rb

 def create
 	@category = Category.new(params.require(:category).permit(:name))
 	 if @category.save
---
INSERT INTO "categories" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Mon, 14 Apr 2014 15:38:11 UTC +00:00], ["name", "test"], ["updated_at", Mon, 14 Apr 2014 15:38:11 UTC +00:00]]