app/controllers/comments_controller.rb

  def create
  	@post = Post.find(params[:post_id])
  	@comment = @post.comments.build(params.require(:comment).permit(:body))
    @comment.creator = current_user
  	if @comment.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "7"]]
INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["body", "test 2"], ["created_at", Tue, 15 Apr 2014 11:37:37 UTC +00:00], ["post_id", 7], ["updated_at", Tue, 15 Apr 2014 11:37:37 UTC +00:00], ["user_id", 1]]

  def vote
    comment = Comment.find(params[:id])
    Vote.create(voteable: comment, creator: current_user, vote: params[:vote])
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "votes" ("created_at", "updated_at", "user_id", "vote", "voteable_id", "voteable_type") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Tue, 22 Apr 2014 20:54:27 UTC +00:00], ["updated_at", Tue, 22 Apr 2014 20:54:27 UTC +00:00], ["user_id", 20], ["vote", true], ["voteable_id", 1], ["voteable_type", "Comment"]]