app/controllers/posts_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT 1
INSERT INTO "posts" ("created_at", "description", "title", "updated_at", "url", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Mon, 14 Apr 2014 11:56:00 UTC +00:00], ["description", "abc"], ["title", "abc"], ["updated_at", Mon, 14 Apr 2014 11:56:00 UTC +00:00], ["url", "abc"], ["user_id", 1]]
---
  def create
    @post = Post.new(post_params)
    @post.creator = User.first #TODO: change once we have authentication
      if @post.save