app/controllers/posts_controller.rb

INSERT INTO "votes" ("created_at", "updated_at", "user_id", "vote", "voteable_id", "voteable_type") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Tue, 22 Apr 2014 15:29:32 UTC +00:00], ["updated_at", Tue, 22 Apr 2014 15:29:32 UTC +00:00], ["user_id", 20], ["vote", true], ["voteable_id", 1], ["voteable_type", "Post"]]
---
  def vote
    @vote = Vote.create(voteable: @post, creator: current_user, vote: params[:vote])