app/controllers/users_controller.rb

  def create
  	@user = User.create(user_params)
---
INSERT INTO "users" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Thu, 17 Apr 2014 17:04:36 UTC +00:00], ["updated_at", Thu, 17 Apr 2014 17:04:36 UTC +00:00]]